****PYTHON FUNDAMENTALS CAPSTONE****

In [1]:
# importing basic libraries
#import pandas library
import pandas as pd
#import numpy library
import numpy as np

**Task_1 :** There are three different tables as given above. Please make three dataframe in python and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only

In [2]:
# creation of project dataframe
project_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005', 'A002', 'A005', 'A003', 'A001', 'A003', 'A001', 'A004', 'A004', 'A005'],
    'Project': ['Project 1', 'Project 2', 'Project 3', 'Project 4', 'Project 5', 'Project 6', 'Project 7', 'Project 8', 'Project 9', 'Project 10', 'Project 11', 'Project 12', 'Project 13', 'Project 14'],
    'Cost': [1002000, 2000000, 4500000, 5500000, None, 680000, 400000, 350000, None, 300000, 2000000, 1000000, 3000000, 200000],
    'Status': ['Finished', 'Ongoing', 'Finished', 'Ongoing', 'Finished', 'Failed', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Finished']
}

# Creating the DataFrame
df_project= pd.DataFrame(project_data)

#printing dataframe
print(df_project)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [3]:
# Converting to CSV
df_project.to_csv('project_data.csv', index=False)

#printing output if successful
print("CSV file created successfully.")

CSV file created successfully.

In [4]:
# creation of employee dataframe
employee_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Name': ['John Alter', 'Alice Luxumberg', 'Tom Sabestine', 'Nina Adgra', 'Amy Johny'],
    'Gender': ['M', 'F', 'M', 'F', 'F'],
    'City': ['Paris', 'London', 'Berlin', 'Newyork', 'Madrid'],
    'Age': [25, 27, 29, 31, 30]
}

# Creating DataFrame
df_employee = pd.DataFrame(employee_data)
#printing dataframe
print(df_employee)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [5]:
# Converting employee dataframe to CSV
df_employee.to_csv('employee_data.csv', index=False)

#printing outcome if successful
print("CSV file created successfully.")

CSV file created successfully.

In [6]:
#creation of seniority level dataframe
seniority_level_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Designation Level': [2, 2, 3, 2, 3]
}

# Creating DataFrame
df_seniority = pd.DataFrame(seniority_level_data)
#printing dataframe
print(df_seniority)

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [7]:
# Converting seniority level dataframe to CSV
df_seniority.to_csv('seniority_level_data.csv', index=False)

#printing dataframe if successfull
print("CSV file created successfully.")

CSV file created successfully.

**Task_2 :** The cost column in the dataframe “Project” has some missing values.
Your task is to compute these missing values. Replace the missing values by running average. 
You should use the “For” loop for this task.

In [8]:
#importing project.csv created from the first task
df_pr=pd.read_csv('project_data.csv')
#printing dataframe
print(df_pr)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [9]:
# we have to calculate average, hence checking if Cost column is numeric data type
df_pr["Cost"].dtypes

dtype('float64')

we can see dtype if float64 and is numeric and can be used to calculate average

In [10]:
# Iterate through the dataframe to compute running average for missing values
for i in range(len(df_pr)):
    #calculate running average only if cost is missing
    if pd.isna(df_pr.loc[i, 'Cost']):
        # Calculate the running average excluding the current missing value
        running_avg = np.nanmean(df_pr['Cost'][:i])
        # replace null value with running average
        df_pr.loc[i, 'Cost'] = running_avg

print(df_pr)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

We can see that the missing values have been replaced with running average. For loop and numpy function have been used to do so.
Please note wherever missing value is present it has been replaced with running average, the first running average value calculated has been included in computing the running average of the next missing value.

In [11]:
#we will save a new csv with missing values replaced for future steps.
df_pr.to_csv("project_data.csv")

**Task 3 :** Split the name column in the Employee dataframe into two new columns “First Name”,and “LastName” and remove the older “name” column.

In [12]:
#reading csv file
df_emp = pd.read_csv('employee_data.csv')

# Splitting the "Name" column into "First Name" and "Last Name"
df_emp[['First Name', 'Last Name']] = df_emp['Name'].str.split(' ', n=1, expand=True)

# Dropping the original "Name" column
df_emp.drop(columns=['Name'], inplace=True)

# Displaying heading for table to be displayed later
print("Updated DataFrame:")
# Displaying the updated DataFrame with values
print(df_emp)

Updated DataFrame:
     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [13]:
#updating the csv file for future tasks.
df_emp.to_csv('employee_data.csv')

**Task 4:** Join all three dataframes in one single dataframe. Name it “Final”

In [14]:
#read updated csv files
#read project file
df_project = pd.read_csv('project_data.csv',index_col=0)
#read employee file
df_employee = pd.read_csv('employee_data.csv',index_col=0)
#read seniority level file
df_seniority_level = pd.read_csv('seniority_level_data.csv',index_col=0)

# Merging the DataFrames

#merging project and employee dataframes
Final = pd.merge(df_project, df_employee, on='ID')
#merging seniority level dataframe to the created dataframe from merging above
Final = pd.merge(Final, df_seniority_level, on='ID')

#printing heading
print("Final DataFrame:")

#printing outcome of created dataframe
print(Final)

Final DataFrame:
      ID     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level
0       Alter                  2
1   Luxumberg                  2
2   Sabestine                  3
3       Adgra                  2
4       Johny                  3
5   Luxumberg                  2
6       Johny                  3
7   Sabestine                  3
8       Alter                  2
9   Sabestine                  3
10      Alter                  2
11      Adgra                  2
12      Adgra                  2
13      Johny                  3

In [15]:
# we can see tables have been joined into a single table.
#displaying head
Final.head()

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level
0,A001,Project 1,1002000.0,Finished,M,Paris,25,John,Alter,2
1,A002,Project 2,2000000.0,Ongoing,F,London,27,Alice,Luxumberg,2
2,A003,Project 3,4500000.0,Finished,M,Berlin,29,Tom,Sabestine,3
3,A004,Project 4,5500000.0,Ongoing,F,Newyork,31,Nina,Adgra,2
4,A005,Project 5,3250500.0,Finished,F,Madrid,30,Amy,Johny,3

**Task 5 :** Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project 
cost only to employees who have finished the projects.

In [16]:
# To calculate bonus based on project cost for employees who have finished the projects.

# Create a new 'Bonus' column: 5% of project_cost if project is finished, else 0
Final['Bonus'] = Final.apply(lambda row: 0.05 * row['Cost'] if row['Status'] == 'Finished' else 0,axis=1)
#displaying output of updated dataframe
print(Final)

      ID     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2       0.0
2   Sabestine                  3  225000.0
3       Adgra                  2       0.0
4       Johny                  3  162525.0
5   Luxumberg                  2       0.0
6       Johny                  3   20000.0
7   Sabestine                  3       0.0
8       Alter                  2       0.0
9   Sabestine                  3   15000.0
10      Alter                  2       0.0
11      Adgra                  2       0.0
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

**Task 6 :** Demote the designation level by 1, whose projects have status “fail”. Delete the employees record whose designation level is above 4.

In [17]:
# Demoting the designation level by 1 for employees whose projects have status "Failed"
Final.loc[Final['Status'] == 'Failed', 'Designation Level'] = Final.loc[Final['Status'] == 'Failed', 'Designation Level'] + 1
#displaying output of updated dataframe
print(Final)

      ID     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2       0.0
2   Sabestine                  3  225000.0
3       Adgra                  2       0.0
4       Johny                  3  162525.0
5   Luxumberg                  3       0.0
6       Johny                  3   20000.0
7   Sabestine                  4       0.0
8       Alter                  2       0.0
9   Sabestine                  3   15000.0
10      Alter                  3       0.0
11      Adgra                  2       0.0
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

In [18]:
#we can see wherever Status is Failed, there Designation has increased by 1 as lower Designation indicated higher position 
#and hence for demotion Designation has been increased

In [19]:
# Deleting records of employees whose designation level is above 4
Final = Final[Final['Designation Level'] <= 4]

In [20]:
# Displaying the updated dataframe
print("Updated DataFrame after demoting and deleting records:")
#displaying output of updated dataframe
print(Final)

Updated DataFrame after demoting and deleting records:
      ID     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M   Berlin   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3250500.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M   Berlin   29        Tom
8   A001   Project 9  2210312.5   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M   Berlin   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2       0.0
2   Sabestine                  3  225000.0
3       Adgra                  2       0.0
4       Johny                  3  162525.0
5   Luxumberg                  3       0.0
6       Johny                  3   20000.0
7   Sabestine                  4       0.0
8       Alter                  2       0.0
9   Sabestine                  3   15000.0
10      Alter                  3       0.0
11      Adgra                  2       0.0
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

In [21]:
#none of the record has been deleted

**Task 7 :** Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [22]:
# Adding "Mr." and "Mrs." based on gender to the first name column
Final['First Name'] = Final.apply(lambda row: 'Mr. ' + row['First Name'] if row['Gender'] == 'M' else 'Mrs. ' + row['First Name'], axis=1)

# Dropping the "Gender" column
Final.drop(columns=['Gender'], inplace=True)

#Displaying heading for table to be displayed
print("Updated Final DataFrame:")
# Displaying the updated final DataFrame
print(Final)

Updated Final DataFrame:
      ID     Project       Cost    Status     City  Age  First Name  \
0   A001   Project 1  1002000.0  Finished    Paris   25    Mr. John
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs. Alice
2   A003   Project 3  4500000.0  Finished   Berlin   29     Mr. Tom
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs. Nina
4   A005   Project 5  3250500.0  Finished   Madrid   30    Mrs. Amy
5   A002   Project 6   680000.0    Failed   London   27  Mrs. Alice
6   A005   Project 7   400000.0  Finished   Madrid   30    Mrs. Amy
7   A003   Project 8   350000.0    Failed   Berlin   29     Mr. Tom
8   A001   Project 9  2210312.5   Ongoing    Paris   25    Mr. John
9   A003  Project 10   300000.0  Finished   Berlin   29     Mr. Tom
10  A001  Project 11  2000000.0    Failed    Paris   25    Mr. John
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs. Nina
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs. Nina
13  A005  Project 14   200000.0  Finished   Madrid   30    Mrs. Amy

    Last Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2       0.0
2   Sabestine                  3  225000.0
3       Adgra                  2       0.0
4       Johny                  3  162525.0
5   Luxumberg                  3       0.0
6       Johny                  3   20000.0
7   Sabestine                  4       0.0
8       Alter                  2       0.0
9   Sabestine                  3   15000.0
10      Alter                  3       0.0
11      Adgra                  2       0.0
12      Adgra                  2  150000.0
13      Johny                  3   10000.0

In [23]:
#we can see Mr/Mrs has been added to the First Name and Gender column has been removed.

**Task 8 :** Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

In [24]:
#iterating to check for all rows in dataframe
for index, row in Final.iterrows():
    # Checking if age is more than 29
    if row['Age'] > 29:
        # Promoting designation level by 1
        Final.at[index, 'Designation Level'] -= 1

#printing heading for the table to follow
print("Updated DataFrame with promoted designation level for employees above 29 years of age:")
# Displaying the updated DataFrame
print(Final)

Updated DataFrame with promoted designation level for employees above 29 years of age:
      ID     Project       Cost    Status     City  Age  First Name  \
0   A001   Project 1  1002000.0  Finished    Paris   25    Mr. John
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs. Alice
2   A003   Project 3  4500000.0  Finished   Berlin   29     Mr. Tom
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs. Nina
4   A005   Project 5  3250500.0  Finished   Madrid   30    Mrs. Amy
5   A002   Project 6   680000.0    Failed   London   27  Mrs. Alice
6   A005   Project 7   400000.0  Finished   Madrid   30    Mrs. Amy
7   A003   Project 8   350000.0    Failed   Berlin   29     Mr. Tom
8   A001   Project 9  2210312.5   Ongoing    Paris   25    Mr. John
9   A003  Project 10   300000.0  Finished   Berlin   29     Mr. Tom
10  A001  Project 11  2000000.0    Failed    Paris   25    Mr. John
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs. Nina
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs. Nina
13  A005  Project 14   200000.0  Finished   Madrid   30    Mrs. Amy

    Last Name  Designation Level     Bonus
0       Alter                  2   50100.0
1   Luxumberg                  2       0.0
2   Sabestine                  3  225000.0
3       Adgra                  1       0.0
4       Johny                  2  162525.0
5   Luxumberg                  3       0.0
6       Johny                  2   20000.0
7   Sabestine                  4       0.0
8       Alter                  2       0.0
9   Sabestine                  3   15000.0
10      Alter                  3       0.0
11      Adgra                  1       0.0
12      Adgra                  1  150000.0
13      Johny                  2   10000.0

**Task 9 :** Add the cost of all projects for each Employee and save it in new dataframe 
“TotalProjCost” with three columns ID, First Name, and Total cost

In [25]:
#Create a new tabe “TotalProjCost” with three columns ID, First Name, and Total cost 

# Grouping by ID and First Name, then sum the cost for each employee
TotalProjCost = Final.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

# Renaming the 'Cost' column to 'Total cost'
TotalProjCost.rename(columns={'Cost': 'Total cost'}, inplace=True)

# Displaying heading for table to follow
print("DataFrame 'TotalProjCost' with total project cost for each employee:")
# Displaying the new DataFrame
print(TotalProjCost)

DataFrame 'TotalProjCost' with total project cost for each employee:
     ID  First Name  Total cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

**Task 10:** Print all the employee details whose city name contains the letter “o” in it.

In [26]:
# Filtering the DataFrame to select rows where the city name contains the letter "o"
employees_with_o_city = df_employee[df_employee['City'].str.contains('o', case=False)]

# displaying heading for table to follow
print("Employee details whose city name contains the letter 'o':")
# Printing the details of employees with cities containing the letter "o"
print(employees_with_o_city)

Employee details whose city name contains the letter 'o':
     ID Gender     City  Age First Name  Last Name
1  A002      F   London   27      Alice  Luxumberg
3  A004      F  Newyork   31       Nina      Adgra

In [27]:
#adding total cost to the details.

employees_with_o_city = pd.merge(employees_with_o_city, TotalProjCost[["ID","Total cost"]], on='ID')
#displaying the updated dataframe
print(employees_with_o_city)

     ID Gender     City  Age First Name  Last Name  Total cost
0  A002      F   London   27      Alice  Luxumberg   2680000.0
1  A004      F  Newyork   31       Nina      Adgra   9500000.0

In [28]:
#Filtering more details from Final database
employees_with_o_city = Final[Final['City'].str.contains('o', case=False)]
#printing the output table
print(employees_with_o_city)

      ID     Project       Cost    Status     City  Age  First Name  \
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs. Alice
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs. Nina
5   A002   Project 6   680000.0    Failed   London   27  Mrs. Alice
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs. Nina
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs. Nina

    Last Name  Designation Level     Bonus
1   Luxumberg                  2       0.0
3       Adgra                  1       0.0
5   Luxumberg                  3       0.0
11      Adgra                  1       0.0
12      Adgra                  1  150000.0